export enum COMMON_RELAY_NAME {
  /**
   * Освещение - Гостиная - Основной - Часть 1 ( SL1 ) - 1 - 1
   */
  RELAY_1 = "RELAY_1",
  /**
   * Освещение - Гостиная - Основной - Часть 2 ( SL2 ) - 1- 2
   */
  RELAY_2 = "RELAY_2",
  /**
   * Освещение - Гостиная - Основной - Часть 3 ( SL3 ) - 1 - 3
   */
  RELAY_3 = "RELAY_3",
  /**
   * Освещение - Гостиная - Основной - Часть 4 ( SL4 ) - 1 - 4
   */
  RELAY_4 = "RELAY_4",
  /**
   * Освещение - Гостиная - Основной - Часть 5 ( SL5 ) - 1 - 5
   */
  RELAY_5 = "RELAY_5",
  /**
   * Освещение - Гостиная - Основной - Часть 6 ( SL6 ) - 1 - 6
   */
  RELAY_6 = "RELAY_6",
  /**
   * Освещение - Гостиная - Основной - Часть 7 ( SL7 ) - 2 - 1
   */
  RELAY_7 = "RELAY_7",
  /**
   * Освещение - Игровая - Основной - Часть 1 ( SL8 ) - 2 - 2
   */
  RELAY_8 = "RELAY_8",
  /**
   * Освещение - Игровая - Основной - Часть 2 ( SL9 ) - 2 - 3
   */
  RELAY_9 = "RELAY_9",
  /**
   * Освещение - Игровая - Люстра ( SL10 ) - 2 - 4
   */
  RELAY_10 = "RELAY_10",
  /**
   * Освещение - Игровая - Тумбочки ( SL11 ) - 2 - 5
   */
  RELAY_11 = "RELAY_11",
  /**
   * Освещение - Игровая - Рабочий стол ( SL12 ) - 2 - 6
   */
  RELAY_12 = "RELAY_12",
  /**
   * Освещение - Ванная - Основной ( SL13 ) - 3 - 1
   */
  RELAY_13 = "RELAY_13",
  /**
   * Обогрев - Ванная - Зеркало ( SL14 ) - 3 - 2
   */
  RELAY_14 = "RELAY_14",
  /**
   * Освещение - Спальня - Основной ( SL15 ) - 3 - 3
   */
  RELAY_15 = "RELAY_15",
  /**
   * Освещение - Спальня - Тумбочки ( SL16 ) - 3 - 4
   */
  RELAY_16 = "RELAY_16",
  /**
   * Освещение - Прихожая - Основной - Часть 1 ( SL17 ) - 3 - 5
   */
  RELAY_17 = "RELAY_17",
  /**
   * Освещение - Прихожая - Основной - Часть 2 ( SL18 ) - 3 - 6
   */
  RELAY_18 = "RELAY_18",
  /**
   * Освещение - Коридор - Основной - Часть 2 ( SL19 ) - 4 - 1
   */
  RELAY_19 = "RELAY_19",
  /**
   * Освещение - Крыльцо ( SL20 ) - 4 - 2
   */
  RELAY_20 = "RELAY_20",
  /**
   * Освещение - Хозяйственная - Основной ( SL21 ) - 4 - 3
   */
  RELAY_21 = "RELAY_21",
  /**
   * Освещение - Кабинет - Основной - Часть 1 ( SL22 ) - 4 - 4
   */
  RELAY_22 = "RELAY_22",
  /**
   * Освещение - Кабинет - Основной - Часть 2 ( SL23 ) - 4 - 5
   */
  RELAY_23 = "RELAY_23",
  /**
   * Освещение - Кабинет - Рабочий стол 1 ( SL24 ) - 4 - 6
   */
  RELAY_24 = "RELAY_24",
  /**
   * Освещение - Кабинет - Рабочий стол 2 ( SL25 ) - 5 - 1
   */
  RELAY_25 = "RELAY_25",
  /**
   * Освещение - Инженерная ( SL26 ) - 5 - 2
   */
  RELAY_26 = "RELAY_26",
  /**
   * Освещение - Крыша ( SL27 ) - 5 - 3
   */
  RELAY_27 = "RELAY_27",
  /**
   * Освещение - Feron.PRO LL-1000 50W 41542 ( SL28 ) - 5 - 4
   */
  RELAY_28 = "RELAY_28",
  /**
   * Освещение - Feron.PRO LL-1000 50W 41542 ( SL29 ) - 5 - 5
   */
  RELAY_29 = "RELAY_29",
  /**
   * Освещение - Feron.PRO LL-1000 50W 41542 ( SL30 ) - 5 - 6
   */
  RELAY_30 = "RELAY_30",
  /**
   * Освещение - Feron.PRO LL-1000 50W 41542 ( SL31 ) - 6 - 1
   */
  RELAY_31 = "RELAY_31",
  /**
   * Освещение - Feron.PRO LL-1000 50W 41542 ( SL32 ) - 6 - 2
   */
  RELAY_32 = "RELAY_32",
  /**
   * Освещение - Feron.PRO LL-1000 50W 41542 ( SL33 ) - 6 - 3
   */
  RELAY_33 = "RELAY_33",
  /**
   * Освещение - Feron.PRO LL-1000 50W 41542 ( SL34 ) - 6 - 4
   */
  RELAY_34 = "RELAY_34",
  /**
   * Освещение - Feron.PRO LL-1000 50W 41542 ( SL35 ) - 6 - 5
   */
  RELAY_35 = "RELAY_35",
  /**
   * Освещение - Feron.PRO LL-1000 50W 41542 ( SL36 ) - 6 - 6
   */
  RELAY_36 = "RELAY_36",
  /**
   * Освещение - Feron.PRO LL-1000 50W 41542 ( SL37 ) - 7 - 1
   */
  RELAY_37 = "RELAY_37",
  /**
   * Освещение фасада - 6м - 8 Вт/м - 48 Вт ( SL38 ) - 7 - 2
   */
  RELAY_38 = "RELAY_38",
  /**
   * Освещение фасада - 6м - 8 Вт/м - 48 Вт ( SL39 ) - 7 - 3
   */
  RELAY_39 = "RELAY_39",
  /**
   * Освещение фасада - 6м - 8 Вт/м - 48 Вт ( SL40 ) - 7 - 4
   */
  RELAY_40 = "RELAY_40",
  /**
   * Освещение фасада - 6м - 8 Вт/м - 48 Вт ( SL41 ) - 7 - 5
   */
  RELAY_41 = "RELAY_41",
  /**
   * Освещение фасада - 6м - 8 Вт/м - 48 Вт ( SL42 ) - 7 - 6
   */
  RELAY_42 = "RELAY_42",
  /**
   * Освещение фасада - 6м - 8 Вт/м - 48 Вт ( SL43 ) - 8 - 1
   */
  RELAY_43 = "RELAY_43",
  /**
   * Освещение фасада - 6м - 8 Вт/м - 48 Вт ( SL44 ) - 8 - 2
   */
  RELAY_44 = "RELAY_44",
  /**
   * Освещение фасада - 6м - 8 Вт/м - 48 Вт ( SL45 ) - 8 - 3
   */
  RELAY_45 = "RELAY_45",
  /**
   * Освещение фасада - 6м - 8 Вт/м - 48 Вт ( SL46 ) - 8 - 4
   */
  RELAY_46 = "RELAY_46",
  /**
   * Освещение фасада - 6м - 8 Вт/м - 48 Вт ( SL47 ) - 8 - 5
   */
  RELAY_47 = "RELAY_47",
  /**
   * Отопление - Насос Кольца ( SL48 ) - 8 - 6
   */
  RELAY_48 = "RELAY_48",
  /**
   * Отопление - Насос Теплого пола ( SL49 ) - 9 - 1
   */
  RELAY_49 = "RELAY_49",
  /**
   * Отопление - Насос радиаторной сети ( SL50 ) - 9 - 2
   */
  RELAY_50 = "RELAY_50",
  /**
   * Обогрев водостока - греющий кабель - слева MAX 20метров  ( SL51 ) - 9 - 3
   */
  RELAY_51 = "RELAY_51",
  /**
   * Обогрев водостока - греющий кабель - слева MAX 20метров  ( SL52 ) - 9 - 4
   */
  RELAY_52 = "RELAY_52",
  /**
   * Обогрев водостока - греющий кабель - слева MAX 20метров  ( SL53 ) - 9 - 5
   */
  RELAY_53 = "RELAY_53",
  /**
   * Увлажнение - Розетка - Гостиная ( SL26 -> SL54 ) - 9 - 6
   */
  RELAY_54 = "RELAY_54",
  /**
   * Увлажнение - Розетка - Игровая  ( SL27 -> SL55 ) - 10 - 1
   */
  RELAY_55 = "RELAY_55",
  /**
   * Увлажнение - Розетка - Спальня ( SL28 -> SL56 ) - 10 - 2
   */
  RELAY_56 = "RELAY_56",
  /**
   * Увлажнение - Розетка - Кабинет ( SL29 -> SL57 ) - 10 - 3
   */
  RELAY_57 = "RELAY_57",
  /**
   * Генератор - Управляющий кабель генератора ( SL58 ) - 10 - 4
   */
  RELAY_58 = "RELAY_58",
  /**
   * Блок питания ИК подсветки ( SL59 ) - 10 - 5
   */
  RELAY_59 = "RELAY_59",
  /**
   * Блок питания ИК подсветки ( SL60 ) - 10 - 6
   */
  RELAY_60 = "RELAY_60",
  /**
   * Привод вентиляционной заслонки - Приточка ( SL61 ) - 11 - 1
   */
  RELAY_61 = "RELAY_61",
  /**
   * Привод вентиляционной заслонки - Вытяжка ( SL62 ) - 11 - 2
   */
  RELAY_62 = "RELAY_62",
  /**
   * Привод вентиляционной заслонки - Кухня - Вытяжка ( SL63 ) - 11 - 3
   */
  RELAY_63 = "RELAY_63",
  /**
   * Привод вентиляционной заслонки - Гостиная ( SL64 ) - 11 - 4
   */
  RELAY_64 = "RELAY_64",
  /**
   * Привод вентиляционной заслонки - Игровая ( SL65 ) - 11 - 5
   */
  RELAY_65 = "RELAY_65",
  /**
   * Привод вентиляционной заслонки - Ванная ( SL66 ) - 11 - 6
   */
  RELAY_66 = "RELAY_66",
  /**
   * Привод вентиляционной заслонки - Спальня ( SL67 ) - 12 - 1
   */
  RELAY_67 = "RELAY_67",
  /**
   * Привод вентиляционной заслонки - Кабинет ( SL68 ) - 12 - 2
   */
  RELAY_68 = "RELAY_68",
  /**
   * Привод вентиляционной заслонки - Хозяйственная ( SL69 ) - 12 - 3
   */
  RELAY_69 = "RELAY_69",
  /**
   * Привод вентиляционной заслонки - Стояк канализации ( SL70 ) - 12 - 4
   */
  RELAY_70 = "RELAY_70",
  /**
   * Отопление - Насос циркуляции ГВС ( SL71 ) - 12 - 5
   */
  RELAY_71 = "RELAY_71",
  /**
   * Отопление - Насос загрузки бойлера ( SL72 ) - 12 - 6
   */
  RELAY_72 = "RELAY_72",
  /**
   * Отопление - Насос вентиляции ( SL73 ) - 1 - 1
   */
  RELAY_73 = "RELAY_73",
  /**
   * Термостат газового котла ( SL74 ) - 1 - 2
   */
  RELAY_74 = "RELAY_74",
  /**
   * Термостат электрического котла ( SL75 ) - 1 - 3
   */
  RELAY_75 = "RELAY_75",
}
